; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :strips :typing)
  (:types
    phys_object location crate_type number container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    food_crate medicine_crate - crate_type
    depot - location


    n0 n1 n2 n3 n4 - number
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - number)

    (next ?numA - number ?numB - number)
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    )
   )

  (:action load_crate_on_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - number ?new_nb_loaded - number)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?h ?c)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?nb_loaded ?new_nb_loaded)
      )
    :effect
    (and
      (not (nb_loaded_crates ?r ?nb_loaded))
      (nb_loaded_crates ?r ?new_nb_loaded)
      (not (contains ?h ?c))
      (contains ?r ?c)
      )
    )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?to)) (at ?h ?from)
      (not (at ?r ?to)) (at ?r ?from)
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - number ?new_nb_loaded - number)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      )
    )
  )

; problem
(define (problem simple-problem-p4)
  (:domain EMERGENCY_SERVICES_LOGISTICS)

  (:objects
  	p1 - victim
  	p2 - victim
  	p3 - victim
  	p4 - victim
  	l1 - location
  	l2 - location
  	l3 - location
  	l4 - location
  	c1 - crate
  	c2 - crate
  	c3 - crate
  	c4 - crate

  	r - carrier

  	h - helicopter
  )
  (:init
    (next n0 n1) (next n1 n2) (next n2 n3) (next n3 n4)

  	(at h depot)
  	(at r depot)
  	(at c1 depot)
  	(at c2 depot)
  	(at c3 depot)
  	(at c4 depot)
  	(at p1 l1)
  	(at p2 l2)
  	(at p3 l3)
  	(at p4 l4)

  	(empty h)

  	(can_be_taken c1)
  	(can_be_taken c2)
  	(can_be_taken c3)
  	(can_be_taken c4)

    (is_type c1 food_crate)
    (is_type c2 food_crate)
    (is_type c3 food_crate)
    (is_type c4 food_crate)
  ) 

  (:goal
 	(and
 		(at h depot)

		(has_crate p1 food_crate)
		(has_crate p2 food_crate)
		(has_crate p3 food_crate)
		(has_crate p4 food_crate)
  	)
  )
 )

; plan
1. (pick_up h c1 depot)
   deleted: (empty h) (can_be_taken c1) (at c1 depot)
   added: (contains h c1)
   goals met: 1 of 5
2. (move h depot l4)
   deleted: (at h depot)
   added: (at h l4)
   goals met: 0 of 5
3. (give h c1 p4 l4 food_crate)
   deleted: (contains h c1)
   added: (empty h) (can_be_taken c1) (has_crate p4 food_crate)
   goals met: 1 of 5
4. (move h l4 depot)
   deleted: (at h l4)
   added: (at h depot)
   goals met: 2 of 5
5. (pick_up h c2 depot)
   deleted: (empty h) (can_be_taken c2) (at c2 depot)
   added: (contains h c2)
   goals met: 2 of 5
6. (move h depot l3)
   deleted: (at h depot)
   added: (at h l3)
   goals met: 1 of 5
7. (give h c2 p3 l3 food_crate)
   deleted: (contains h c2)
   added: (empty h) (can_be_taken c2) (has_crate p3 food_crate)
   goals met: 2 of 5
8. (move h l3 depot)
   deleted: (at h l3)
   added: (at h depot)
   goals met: 3 of 5
9. (pick_up h c3 depot)
   deleted: (empty h) (can_be_taken c3) (at c3 depot)
   added: (contains h c3)
   goals met: 3 of 5
10. (move h depot l2)
   deleted: (at h depot)
   added: (at h l2)
   goals met: 2 of 5
11. (give h c3 p2 l2 food_crate)
   deleted: (contains h c3)
   added: (empty h) (can_be_taken c3) (has_crate p2 food_crate)
   goals met: 3 of 5
12. (move h l2 depot)
   deleted: (at h l2)
   added: (at h depot)
   goals met: 4 of 5
13. (pick_up h c4 depot)
   deleted: (empty h) (can_be_taken c4) (at c4 depot)
   added: (contains h c4)
   goals met: 4 of 5
14. (move h depot l1)
   deleted: (at h depot)
   added: (at h l1)
   goals met: 3 of 5
15. (give h c4 p1 l1 food_crate)
   deleted: (contains h c4)
   added: (empty h) (can_be_taken c4) (has_crate p1 food_crate)
   goals met: 4 of 5
16. (move h l1 depot)
   deleted: (at h l1)
   added: (at h depot)
   goals met: 5 of 5
